# NoKeynoteAssignedToLinkedElement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeynoteTagFailures..::..NoKeynoteAssignedToLinkedElement Property
BuiltInFailures..::..KeynoteTagFailures Class See Also
---
The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoKeynoteAssignedToLinkedElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoKeynoteAssignedToLinkedElement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoKeynoteAssignedToLinkedElement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..KeynoteTagFailures Class
Autodesk.Revit.DB Namespace